app/Controllers/Auth.php

public function loginAuth() {
        $session = session();
        $model = new UsuarioModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1