app/Controllers/RegisterController.php

    public function store() {
        $userModel = new UsuarioModel();
        $data = [
            'nombre'     => $this->request->getPost('nombre'),
            'email'      => $this->request->getPost('email'),
            'password'   => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'key_niveles'=> $this->request->getPost('key_niveles'),
            'key_estatus'=> 1
        ];
        $userModel->save($data);
---
INSERT INTO `usuarios` (`nombre`, `email`, `password`, `key_niveles`, `key_estatus`) VALUES ('usuario', 'usuario@gmail.com', '$2y$10$HdpWnitcaU.SVNj7Xb2m.uPb6xig/mS1tsM0E2pwCozMGDd3B7Xjm', '2', 1)